## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                         |
|--------|------------------------------------------------------|
| add    | `aws_ecrpublic_repository.generate_sbom_public`      |
|        | `aws_ecrpublic_repository_policy.sbom_public_policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecrpublic_repository.generate_sbom_public will be created
  + resource "aws_ecrpublic_repository" "generate_sbom_public" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
    }

  # aws_ecrpublic_repository_policy.sbom_public_policy will be created
  + resource "aws_ecrpublic_repository_policy" "sbom_public_policy" {
      + id              = (known after apply)
      + policy          = (sensitive)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
